In [1]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'1.5.3'

In [9]:
None,np.nan # np.nan - jest zmiennoprzecinkowa

(None, nan)

In [6]:
s = pd.Series([1,3,4,np.nan,6,8]) #lista
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
type(s)

pandas.core.series.Series

In [12]:
dates = pd.date_range('20130101', periods =6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [17]:
df = pd.DataFrame({'A':[1,2,3],
                  'B':[4,5,6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [18]:
type(df)

pandas.core.frame.DataFrame

In [65]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns =list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.193275 -0.133109  0.013696  0.761218
2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449
2013-01-04 -0.292412  0.172284  0.314251 -0.994351
2013-01-05  0.235916 -0.625086  0.362070  1.782928
2013-01-06 -0.418294 -0.284447 -0.041210  0.077003

In [22]:
np.random.randn(6,4)

array([[ 0.50655447,  0.44203963,  0.65850916,  0.10734922],
       [ 0.00519433, -2.26612183, -0.91280369, -0.19486448],
       [ 0.82825871,  1.38062422, -1.04215087, -0.18837006],
       [ 1.51443609, -1.48306582, -0.56856706, -1.79733474],
       [-0.18426356, -0.61389694, -2.4464107 ,  0.43978299],
       [ 0.69149574, -0.70288865,  0.29311771,  0.58422928]])

In [23]:
type(np.random.randn(6,4))

numpy.ndarray

In [25]:
df2 = pd.DataFrame({
                    'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo',
                    'G' : [False, True,True,False]
                   })
df2

     A          B    C  D      E    F      G
0  1.0 2013-01-02  1.0  3   test  foo  False
1  1.0 2013-01-02  1.0  3  train  foo   True
2  1.0 2013-01-02  1.0  3   test  foo   True
3  1.0 2013-01-02  1.0  3  train  foo  False

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      bool
dtypes: bool(1), category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 292.0+ bytes

In [27]:
type(pd.Timestamp('20130102'))

pandas._libs.tslibs.timestamps.Timestamp

In [29]:
df2['B'].values[0] # wartość kolumny B, wiersza 0

numpy.datetime64('2013-01-02T00:00:00.000000000')

In [30]:
type([False, True,True,False])

list

In [32]:
df2['G'].values[0] # wartość kolumny G, wiersza 0

False

In [36]:
df = pd.DataFrame({'A':[1,'2',3],
                  'B':[4,5,6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [38]:
df.info() # type object utożsamiamy ze stringiem, pod stringiem może być wszystko

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      object
 1   B       3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [ ]:
df['A'].sum() # nie może policzyć, bo 2 jest stringiem/obiektem a nie int/float

In [43]:
dane_sprzedaz_df = pd.read_csv('dane_sprzedaz.csv', sep=',', encoding='utf-8')
dane_sprzedaz_df

     DZIEN_DATA  SKL_ID  TOW_ID  SPRZ_NETTO  ZYSK_PROCENT ZYSK_WART
0    01.05.2022       1       1       416.0             9     37,44
1    02.05.2022       1       1       454.0             2      9,08
2    03.05.2022       1       1       392.0            13     50,96
3    04.05.2022       1       1       498.0             9     44,82
4    05.05.2022       1       1       341.0            15     51,15
..          ...     ...     ...         ...           ...       ...
130  11.05.2022       3       3       374.0             7     26,18
131  12.05.2022       3       3       390.0             4      15,6
132  13.05.2022       3       3       485.0            10      48,5
133  14.05.2022       3       3       479.0             3     14,37
134  15.05.2022       3       3       366.0            13     47,58

[135 rows x 6 columns]

In [45]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns =list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.241625 -0.960784 -0.997829 -0.936463
2013-01-02  0.132536 -0.380936 -0.462789  0.366983
2013-01-03  0.484500 -0.537427 -1.217189  0.529330
2013-01-04  1.449372  0.233478 -0.190024  1.206300
2013-01-05  0.427434  0.073050  0.395850 -0.880997
2013-01-06 -2.408341 -0.776620  1.017928  1.551650

In [46]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.241625 -0.960784 -0.997829 -0.936463
2013-01-02  0.132536 -0.380936 -0.462789  0.366983
2013-01-03  0.484500 -0.537427 -1.217189  0.529330

In [47]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.449372  0.233478 -0.190024  1.206300
2013-01-05  0.427434  0.073050  0.395850 -0.880997
2013-01-06 -2.408341 -0.776620  1.017928  1.551650

In [48]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [49]:
df.values

array([[-0.24162518, -0.96078368, -0.99782914, -0.93646258],
       [ 0.13253577, -0.38093585, -0.4627888 ,  0.36698348],
       [ 0.48450033, -0.53742739, -1.21718939,  0.52933029],
       [ 1.44937179,  0.23347775, -0.19002379,  1.20629974],
       [ 0.42743437,  0.07305007,  0.39584969, -0.88099669],
       [-2.40834146, -0.77661963,  1.01792827,  1.55165   ]])

In [50]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [51]:
# z macierza
my_array = np.array([[11,22,33],[44,55,66]])

df_numpy = pd.DataFrame(my_array, columns = ['Column_A','Column_B','Column_C'])

print(df_numpy)
print(type(df_numpy))

   Column_A  Column_B  Column_C
0        11        22        33
1        44        55        66
<class 'pandas.core.frame.DataFrame'>

In [52]:
# ze słownika
data = {
        'col_1': [3, 2, 1, 0], 
        'col_2': ['a', 'b', 'c', 'd']
        }
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [53]:
df

                   A         B         C         D
2013-01-01 -0.241625 -0.960784 -0.997829 -0.936463
2013-01-02  0.132536 -0.380936 -0.462789  0.366983
2013-01-03  0.484500 -0.537427 -1.217189  0.529330
2013-01-04  1.449372  0.233478 -0.190024  1.206300
2013-01-05  0.427434  0.073050  0.395850 -0.880997
2013-01-06 -2.408341 -0.776620  1.017928  1.551650

In [54]:
df.shape # wierszy, column

(6, 4)

In [55]:
df.size

24

In [56]:
len(df) # do pętli

6

In [57]:
df.sample(2) # do testów, wybieramy ilość wierszy

                   A         B         C        D
2013-01-03  0.484500 -0.537427 -1.217189  0.52933
2013-01-06 -2.408341 -0.776620  1.017928  1.55165

In [58]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [59]:
type(df)

pandas.core.frame.DataFrame

In [60]:
df.A # pokaz nam kolumne A

2013-01-01   -0.241625
2013-01-02    0.132536
2013-01-03    0.484500
2013-01-04    1.449372
2013-01-05    0.427434
2013-01-06   -2.408341
Freq: D, Name: A, dtype: float64

In [61]:
type(df.A) # type tylko kolumny A

pandas.core.series.Series

In [62]:
# transpozyvja, zamina kolumn z wierszami
# piwoty, czesciowa zamiana kolumn z wierszami
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.241625    0.132536    0.484500    1.449372    0.427434   -2.408341
B   -0.960784   -0.380936   -0.537427    0.233478    0.073050   -0.776620
C   -0.997829   -0.462789   -1.217189   -0.190024    0.395850    1.017928
D   -0.936463    0.366983    0.529330    1.206300   -0.880997    1.551650

In [68]:
df2 = df.sample(2)

In [69]:
df2

                   A         B         C         D
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449
2013-01-01  0.193275 -0.133109  0.013696  0.761218

In [71]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-04 -0.292412  0.172284  0.314251 -0.994351
2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2013-01-01  0.193275 -0.133109  0.013696  0.761218
2013-01-06 -0.418294 -0.284447 -0.041210  0.077003
2013-01-05  0.235916 -0.625086  0.362070  1.782928
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449

In [73]:
df.reset_index() # bez przypisania df sie nie zmienia

       index         A         B         C         D
0 2013-01-01  0.193275 -0.133109  0.013696  0.761218
1 2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2 2013-01-03  0.831219 -1.237616 -0.156205 -1.449449
3 2013-01-04 -0.292412  0.172284  0.314251 -0.994351
4 2013-01-05  0.235916 -0.625086  0.362070  1.782928
5 2013-01-06 -0.418294 -0.284447 -0.041210  0.077003

In [76]:
df.reset_index(drop=True) #resetuj indeks i wyrzuc go

          A         B         C         D
0  0.193275 -0.133109  0.013696  0.761218
1 -1.656763 -0.124516 -0.093946 -0.095457
2  0.831219 -1.237616 -0.156205 -1.449449
3 -0.292412  0.172284  0.314251 -0.994351
4  0.235916 -0.625086  0.362070  1.782928
5 -0.418294 -0.284447 -0.041210  0.077003

In [78]:
df.reset_index(drop=False) #resetuj indeks i nie wyrzucaj go

       index         A         B         C         D
0 2013-01-01  0.193275 -0.133109  0.013696  0.761218
1 2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2 2013-01-03  0.831219 -1.237616 -0.156205 -1.449449
3 2013-01-04 -0.292412  0.172284  0.314251 -0.994351
4 2013-01-05  0.235916 -0.625086  0.362070  1.782928
5 2013-01-06 -0.418294 -0.284447 -0.041210  0.077003

In [79]:
# agregacja na df

In [80]:
df

                   A         B         C         D
2013-01-01  0.193275 -0.133109  0.013696  0.761218
2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449
2013-01-04 -0.292412  0.172284  0.314251 -0.994351
2013-01-05  0.235916 -0.625086  0.362070  1.782928
2013-01-06 -0.418294 -0.284447 -0.041210  0.077003

In [81]:
df.sum()

A   -1.107060
B   -2.232490
C    0.398656
D    0.081892
dtype: float64

In [82]:
df.min()

A   -1.656763
B   -1.237616
C   -0.156205
D   -1.449449
dtype: float64

In [83]:
df.mean()

A   -0.184510
B   -0.372082
C    0.066443
D    0.013649
dtype: float64

In [84]:
df['A'] # prawdzamy kolumne A, or df[['A']] or df.A

2013-01-01    0.193275
2013-01-02   -1.656763
2013-01-03    0.831219
2013-01-04   -0.292412
2013-01-05    0.235916
2013-01-06   -0.418294
Freq: D, Name: A, dtype: float64

In [85]:
df[['A', 'B']] # prawdzamy kilka kolumn, poprzez podanie listy

                   A         B
2013-01-01  0.193275 -0.133109
2013-01-02 -1.656763 -0.124516
2013-01-03  0.831219 -1.237616
2013-01-04 -0.292412  0.172284
2013-01-05  0.235916 -0.625086
2013-01-06 -0.418294 -0.284447

In [86]:
df[['A', 'B']].sum()

A   -1.10706
B   -2.23249
dtype: float64

In [87]:
df['A'][0] # pierwsza wartosc z kolumny A

0.1932749028836507

In [88]:
df

                   A         B         C         D
2013-01-01  0.193275 -0.133109  0.013696  0.761218
2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449
2013-01-04 -0.292412  0.172284  0.314251 -0.994351
2013-01-05  0.235916 -0.625086  0.362070  1.782928
2013-01-06 -0.418294 -0.284447 -0.041210  0.077003

In [89]:
df[0:3] # wyswietla 3 pierwsze wiersze

                   A         B         C         D
2013-01-01  0.193275 -0.133109  0.013696  0.761218
2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449

In [90]:
df['20130101':'20130103']

                   A         B         C         D
2013-01-01  0.193275 -0.133109  0.013696  0.761218
2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449

In [92]:
# Label vs. Location
# The main distinction between the two methods is:

# loc gets rows (and/or columns) with particular labels. label = 20130101

# iloc gets rows (and/or columns) at integer locations.

In [93]:
b = pd.Series(np.round(np.random.uniform(0,1,10),2))
i = np.r_[0:10]
np.random.shuffle(i)
b.index = i
b

1    0.42
8    0.45
0    0.90
4    0.62
6    0.02
9    0.17
2    0.79
5    0.63
7    0.98
3    0.72
dtype: float64

In [94]:
b.iloc[2] # 3 numer wiersza, leci od 0

0.9

In [95]:
b.loc[2] # wartosc z labelem "2"

0.79

In [96]:
b.loc[0:2] # od labela 0 do 2

0    0.90
4    0.62
6    0.02
9    0.17
2    0.79
dtype: float64

In [97]:
b.iloc[0:2] #od pozycji 0 do 1 po indexie

1    0.42
8    0.45
dtype: float64

In [98]:
df

                   A         B         C         D
2013-01-01  0.193275 -0.133109  0.013696  0.761218
2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449
2013-01-04 -0.292412  0.172284  0.314251 -0.994351
2013-01-05  0.235916 -0.625086  0.362070  1.782928
2013-01-06 -0.418294 -0.284447 -0.041210  0.077003

In [100]:
# df.loc[2:4] nie uda się, bo labele to daty

In [101]:
df.iloc[2:4]

                   A         B         C         D
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449
2013-01-04 -0.292412  0.172284  0.314251 -0.994351

In [102]:
df.loc[dates[0]:dates[2]] # w locu nie ma wykluczania ostatniej wartości

                   A         B         C         D
2013-01-01  0.193275 -0.133109  0.013696  0.761218
2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449

In [103]:
df.loc[dates[1]:dates[0]] # nic nie wyświetli bo po dates[1] nie napotka dates[0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [104]:
# zakres wierszowo-kolumnowy

In [106]:
df[0:3]

                   A         B         C         D
2013-01-01  0.193275 -0.133109  0.013696  0.761218
2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449

In [107]:
# zmiana kierunku
df[3:0:-1]

                   A         B         C         D
2013-01-04 -0.292412  0.172284  0.314251 -0.994351
2013-01-03  0.831219 -1.237616 -0.156205 -1.449449
2013-01-02 -1.656763 -0.124516 -0.093946 -0.095457

In [108]:
df[-3:] # od 3 od końca do końca

                   A         B         C         D
2013-01-04 -0.292412  0.172284  0.314251 -0.994351
2013-01-05  0.235916 -0.625086  0.362070  1.782928
2013-01-06 -0.418294 -0.284447 -0.041210  0.077003